aytacdilek/STM32F1_INA219-NOKIA5110/devices/stm32f10x_ina219.c
/*******************************************************************************
 * File				:	stm32f10x_ina219.c
 * Description		:	STM32F10x library for INA219 sensor which reads
 * 						shunt, current and power ratings
 * Datum			:	2015.07.14
 * Version			:	1.0
 * Author			:	Aytac Dilek
 * email			:	aytacdilek@gmail.com
 * Web				:
 * Platform			:	OPEN103Z-B
 * CPU				:	STM32F103ZET6
 * IDE				:	CooCox CoIDE 1.7.7
 * GCC				:	4.8 2014q2
 * Module			:	INA219
 * Function			:	Read shunt, current and power readings
 * Pin Definitions	:	PB6 => SCL
 * 						PB7 => SDA
 * Note				:	For calculating calibration values i utilized adafruit
 * 						driver. Special thanks to adafruit team for sharing. In
 * 						long term, i will change this methods to make more generic
 * 						and task oriented. This is first release, i have tested
 * 						on evaluation board, it works perfectly.
 * 						Feel free to send me email, ask whatever you want.
*******************************************************************************/


/* Includes *******************************************************************/
#include "stm32f10x_ina219.h"



/* Internal Functions *********************************************************/
void ina219_gpio_init(void);
void ina219_i2c_init(void);
void ina219_configureRegisters(void);



/*******************************************************************************
* Function Name		:	ina219_init
* Description		:	Initialize INA219 sensor
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_init(void){
	/* Enable gpio peripheral */
	ina219_gpio_init();
	/* Enable i2c peripheral */
	ina219_i2c_init();
	/* Enable SysTick Timer */
	systick_init();
	/* Update Configuration registers of INA219 */
	ina219_configureRegisters();
}




/*******************************************************************************
* Function Name		:	ina219_gpio_init
* Description		:	Initialize GPIO peripheral
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_gpio_init(void){
	GPIO_InitTypeDef  GPIO_InitStructure;

	/* Enable Clocks for gpio peripherals */
	RCC_APB2PeriphClockCmd(INA219_I2C_GPIO_CLOCK, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

	/* Configure I2C1 pins: PB6->SCL and PB7->SDA */
	GPIO_InitStructure.GPIO_Pin =  INA219_I2C_SCL_PIN | INA219_I2C_SDA_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
	GPIO_Init(INA219_I2C_PORT, &GPIO_InitStructure);
}




/*******************************************************************************
* Function Name		:	ina219_i2c_init
* Description		:	Initialize I2C peripheral
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_i2c_init(void){
	I2C_InitTypeDef  I2C_InitStructure;

	/* Enable peripheral clocks */
	RCC_APB1PeriphClockCmd(INA219_I2C_PER_CLOCK, ENABLE);

	I2C_DeInit(INA219_I2C);
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStructure.I2C_OwnAddress1 = 0x30;
	I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_InitStructure.I2C_ClockSpeed = INA219_I2C_CLOCK_SPEED;
	I2C_Init(INA219_I2C, &I2C_InitStructure);

	I2C_Cmd(INA219_I2C, ENABLE);

	I2C_AcknowledgeConfig(INA219_I2C, ENABLE);
}



/*******************************************************************************
* Function Name		:	ina219_configureRegisters
* Description		:	Update Configuration registers of INA219
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_configureRegisters(void){
	ina219_currentDivider_mA = 0;
	ina219_powerDivider_mW = 0;

	systick_delayMs(15);

	ina219_setCalibration_32V_2A();
}



/*******************************************************************************
* Function Name		:	ina219_writeRegister
* Description		:	Sends a single command byte over I2C
* Input				:	reg -> 8-bit data, register address
* 						data -> 16-bit data
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_writeRegister(uint8_t reg, uint16_t data){
	/* Wait while the bus is busy */
	while(I2C_GetFlagStatus(INA219_I2C, I2C_FLAG_BUSY));

	/* Enable Acknowledge */
	I2C_AcknowledgeConfig(INA219_I2C, ENABLE);

	/* Send "Start" condition */
	I2C_GenerateSTART(INA219_I2C, ENABLE);
	/* Test on EV5 and clear it */
	while(!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_MODE_SELECT));

	/* Send INA219 address for write */
	I2C_Send7bitAddress(INA219_I2C,  INA219_I2C_ADDRESS_DEFAULT, I2C_Direction_Transmitter);
	/* Test on EV6 and clear it */
	while (!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
	/* Clear EV6 by setting again the PE bit */
	I2C_Cmd(INA219_I2C, ENABLE);


	/* Send "Read User Register" command */
	I2C_SendData(INA219_I2C, reg);
	/* Test on EV8 and clear it */
	while (!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED));

	/* Send MSB of data */
	I2C_SendData(INA219_I2C, (uint8_t) (data >> 8));
	/* Test on EV8 and clear it */
	while (!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
	/* Send LSB of data */
	I2C_SendData(INA219_I2C, (uint8_t) (data & 0xFF));
	/* Test on EV8 and clear it */
	while (!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED));

	/* Send STOP Condition */
	I2C_GenerateSTOP(INA219_I2C, ENABLE);
}



