aytacdilek/STM32F1_INA219-NOKIA5110/devices/stm32f10x_ina219.c
/*******************************************************************************
* Function Name	:	ina219_readRegister
* Description	:	Reads a 16 bit register values over I2C
* Input			:	reg -> 8-bit data, register address
* 					data -> pointer to a 16-bit data
* Output		:	None
* Return		:	None
* Attention		:	When reading from INA219, the last value stored in the register
* 					pointer by a write operation determines which register is read
* 					during a read operation.
* 					To change the register pointer for a read operation, a new value
* 					must be written to the register pointer.
* 					This write is accomplished by issuing a slave address byte with
* 					the R/W bit LOW, followed by the register pointer byte. No
* 					additional data are required. The master then generates a START
* 					condition and sends the slave address byte with the R/W bit HIGH
* 					to initiate the read command.
*******************************************************************************/
void ina219_readRegister(uint8_t reg, uint16_t *data){
	/* Wait while the bus is busy */
	while(I2C_GetFlagStatus(INA219_I2C, I2C_FLAG_BUSY));

	/* Enable Acknowledge */
	I2C_AcknowledgeConfig(INA219_I2C, ENABLE);

	/* Send "Start" condition */
	I2C_GenerateSTART(INA219_I2C, ENABLE);
	/* Test on EV5 and clear it */
	while(!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_MODE_SELECT));

	/* Send INA219 address for write */
	I2C_Send7bitAddress(INA219_I2C,  INA219_I2C_ADDRESS_DEFAULT, I2C_Direction_Transmitter);
	/* Test on EV6 and clear it */
	while (!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
	/* Clear EV6 by setting again the PE bit */
//	I2C_Cmd(INA219_I2C, ENABLE);

	/* Send "Read User Register" command */
	I2C_SendData(INA219_I2C, reg);
	/* Test on EV8 and clear it */
	while (!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED));



	/* Send "Start" condition */
	I2C_GenerateSTART(INA219_I2C, ENABLE);
	/* Test on EV5 and clear it */
	while(!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_MODE_SELECT));

	/* Send INA219 address for read */
	I2C_Send7bitAddress(INA219_I2C,  INA219_I2C_ADDRESS_DEFAULT, I2C_Direction_Receiver);
	/* Test on EV6 and clear it */
	while (!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED));



	while(!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_BYTE_RECEIVED));  /* EV7 */
	*data = I2C_ReceiveData(INA219_I2C) << 8;

	I2C_AcknowledgeConfig(INA219_I2C, DISABLE);
	I2C_GenerateSTOP(INA219_I2C, ENABLE);

	while(!I2C_CheckEvent(INA219_I2C, I2C_EVENT_MASTER_BYTE_RECEIVED));  /* EV7 */
	*data = (uint16_t) I2C_ReceiveData(INA219_I2C) | *data;

	/* Enable Acknowledgement to be ready for another reception */
	I2C_AcknowledgeConfig(INA219_I2C, ENABLE);
}




/*******************************************************************************
* Function Name		:	ina219_setCalibration_32V_2A
* Description		:	Configures to INA219 to be able to measure up to 32V and 2A
* 						of current.  Each unit of current corresponds to 100uA, and
* 						each unit of power corresponds to 2mW. Counter overflow
* 						occurs at 3.2A.
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	These calculations assume a 0.1 ohm resistor is present
*******************************************************************************/
void ina219_setCalibration_32V_2A(void){
	INA219_InitTypeDef INA219_InitStructure;

	INA219_InitStructure.INA219_BusVoltageRange = INA219_BusVoltageRange_32V;
	INA219_InitStructure.INA219_GainRange = INA219_GainRange_8_320mV;
	INA219_InitStructure.INA219_BusADCResolution = INA219_BusADCResolution_12Bit;
	INA219_InitStructure.INA219_ShuntADCResolution = INA219_ShuntADCResolution_12Bit_1S_532uS;
	INA219_InitStructure.INA219_Mode = INA219_Mode_ShuntAndBusVoltageContinuous;

	// By default we use a pretty huge range for the input voltage,
	// which probably isn't the most appropriate choice for system
	// that don't use a lot of power.  But all of the calculations
	// are shown below if you want to change the settings.  You will
	// also need to change any relevant register settings, such as
	// setting the VBUS_MAX to 16V instead of 32V, etc.

	// VBUS_MAX = 32V             (Assumes 32V, can also be set to 16V)
	// VSHUNT_MAX = 0.32          (Assumes Gain 8, 320mV, can also be 0.16, 0.08, 0.04)
	// RSHUNT = 0.1               (Resistor value in ohms)

	// 1. Determine max possible current
	// MaxPossible_I = VSHUNT_MAX / RSHUNT
	// MaxPossible_I = 3.2A

	// 2. Determine max expected current
	// MaxExpected_I = 2.0A

	// 3. Calculate possible range of LSBs (Min = 15-bit, Max = 12-bit)
	// MinimumLSB = MaxExpected_I/32767
	// MinimumLSB = 0.000061              (61uA per bit)
	// MaximumLSB = MaxExpected_I/4096
	// MaximumLSB = 0,000488              (488uA per bit)

	// 4. Choose an LSB between the min and max values
	//    (Preferrably a roundish number close to MinLSB)
	// CurrentLSB = 0.0001 (100uA per bit)

	// 5. Compute the calibration register
	// Cal = trunc (0.04096 / (Current_LSB * RSHUNT))
	// Cal = 4096 (0x1000)

	ina219_calValue = 4096;

	// 6. Calculate the power LSB
	// PowerLSB = 20 * CurrentLSB
	// PowerLSB = 0.002 (2mW per bit)

	// 7. Compute the maximum current and shunt voltage values before overflow
	//
	// Max_Current = Current_LSB * 32767
	// Max_Current = 3.2767A before overflow
	//
	// If Max_Current > Max_Possible_I then
	//    Max_Current_Before_Overflow = MaxPossible_I
	// Else
	//    Max_Current_Before_Overflow = Max_Current
	// End If
	//
	// Max_ShuntVoltage = Max_Current_Before_Overflow * RSHUNT
	// Max_ShuntVoltage = 0.32V
	//
	// If Max_ShuntVoltage >= VSHUNT_MAX
	//    Max_ShuntVoltage_Before_Overflow = VSHUNT_MAX
	// Else
	//    Max_ShuntVoltage_Before_Overflow = Max_ShuntVoltage
	// End If

	// 8. Compute the Maximum Power
	// MaximumPower = Max_Current_Before_Overflow * VBUS_MAX
	// MaximumPower = 3.2 * 32V
	// MaximumPower = 102.4W

	// Set multipliers to convert raw current/power values
	ina219_currentDivider_mA = 10;  // Current LSB = 100uA per bit (1000/100 = 10)
	ina219_powerDivider_mW = 2;     // Power LSB = 1mW per bit (2/1)

