aytacdilek/STM32F1_INA219-NOKIA5110/devices/stm32f10x_ina219.c
	// Set Calibration register to 'Cal' calculated above
	ina219_writeRegister(INA219_REG_CALIBRATION, ina219_calValue);

	// Set Config register to take into account the settings above
	uint16_t config = INA219_CONFIG_BVOLTAGERANGE_16V |
					INA219_CONFIG_GAIN_1_40MV |
					INA219_CONFIG_BADCRES_12BIT |
					INA219_CONFIG_SADCRES_12BIT_1S_532US |
					INA219_CONFIG_MODE_SANDBVOLT_CONTINUOUS;
	ina219_writeRegister(INA219_REG_CONFIG, config);
}




/*******************************************************************************
* Function Name		:	ina219_getBusVoltage_raw
* Description		:	Gets the raw bus voltage (16-bit signed integer, so +-32767)
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
int16_t ina219_getBusVoltage_raw(void){
	uint16_t value;
	ina219_readRegister(INA219_REG_BUSVOLTAGE, &value);

	// Shift to the right 3 to drop CNVR and OVF and multiply by LSB
	return (int16_t)((value >> 3) * 4);
}



/*******************************************************************************
* Function Name		:	ina219_getBusVoltage_raw
* Description		:	Gets the raw shunt voltage (16-bit signed integer, so +-32767)
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
int16_t ina219_getShuntVoltage_raw(void){
	uint16_t value;
	ina219_readRegister(INA219_REG_SHUNTVOLTAGE, &value);
	return (int16_t)value;
}



/*******************************************************************************
* Function Name		:	ina219_getCurrent_raw
* Description		:	Gets the raw shunt voltage (16-bit signed integer, so +-32767)
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
int16_t ina219_getCurrent_raw(void){
	uint16_t value;

	// Sometimes a sharp load will reset the INA219, which will
	// reset the cal register, meaning CURRENT and POWER will
	// not be available ... avoid this by always setting a cal
	// value even if it's an unfortunate extra step
	ina219_writeRegister(INA219_REG_CALIBRATION, ina219_calValue);

	// Now we can safely read the CURRENT register!
	ina219_readRegister(INA219_REG_CURRENT, &value);

	return (int16_t)value;
}



/*******************************************************************************
* Function Name		:	ina219_getShuntVoltage_mV
* Description		:	Gets the raw shunt voltage (16-bit signed integer, so +-32767)
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
float ina219_getShuntVoltage_mV(void){
	int16_t value;
	value = ina219_getShuntVoltage_raw();
	return value * 0.01;
}



/*******************************************************************************
* Function Name		:	ina219_getBusVoltage_V
* Description		:	Gets the shunt voltage in volts
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
float ina219_getBusVoltage_V(void){
	int16_t value = ina219_getBusVoltage_raw();
	return value * 0.001;
}



/*******************************************************************************
* Function Name		:	ina219_getCurrent_mA
* Description		:	Gets the current value in mA, taking into account the
* 						config settings and current LSB
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
float ina219_getCurrent_mA(void){
	float valueDec = ina219_getCurrent_raw();
	valueDec /= ina219_currentDivider_mA;
	return valueDec;
}












/*******************************************************************************
* Function Name		:	ina219_powerOnReset
* Description		:	Setting this bit to '1' generates a system reset that is
* 						the same as power-on reset
* Input				:	None
* Output			:	None
* Return			:	None
* Attention			:	Resets all registers to default values
* 						This bit self-clears
*******************************************************************************/
void ina219_powerOnReset(void){
	ina219_writeRegister(INA219_REG_CONFIG, INA219_CONFIG_RESET);
}




/*******************************************************************************
* Function Name		:	ina219_setBusVoltageRange
* Description		:	Sets Bus Voltage Range
* Input				:	INA219BusVoltageRange_TypeDef
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_setBusVoltageRange(INA219BusVoltageRange_TypeDef bus_voltage){
	ina219_updateConfigurationRegister(bus_voltage, INA219_Mask_BusVoltageRange);
}



/*******************************************************************************
* Function Name		:	ina219_setGainRange
* Description		:	Sets PGA gain range
* Input				:	INA219GainRange_TypeDef
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_setGainRange(INA219GainRange_TypeDef gain){
	ina219_updateConfigurationRegister(gain, INA219_Mask_GainRange);
}




/*******************************************************************************
* Function Name		:	ina219_setBusADCResolution
* Description		:	Sets PGA gain range
* Input				:	INA219BusADCResolution_TypeDef
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_setBusADCResolution(INA219BusADCResolution_TypeDef resolution){
	ina219_updateConfigurationRegister(resolution, INA219_Mask_BusADCResolution);
}




