aytacdilek/STM32F1_INA219-NOKIA5110/devices/stm32f10x_ina219.c
/*******************************************************************************
* Function Name		:	ina219_setShuntADCResolution
* Description		:	Sets Shunt ADC resolution, Bit-9, Bit-10, Bit-11, Bit-12, or
* 						set the number of samples used when averaging results for the
* 						Shunt voltage register
* Input				:	INA219ShuntADCResolution_TypeDef
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_setShuntADCResolution(INA219ShuntADCResolution_TypeDef resolution){
	ina219_updateConfigurationRegister(resolution, INA219_Mask_ShuntADCResolution);
}




/*******************************************************************************
* Function Name		:	ina219_setOperatingMode
* Description		:	Selects continuous, triggered, or power-down mode of operation.
* Input				:	INA219Mode_TypeDef
* Output			:	None
* Return			:	None
* Attention			:	These bits default to continuous shunt and bus measurement mode.
*******************************************************************************/
void ina219_setOperatingMode(INA219Mode_TypeDef mode){
	ina219_updateConfigurationRegister(mode, INA219_Mask_Mode);
}



/*******************************************************************************
* Function Name		:	ina219_updateConfigurationRegister
* Description		:	Updatate configuration register content
* Input				:	INA219Mask_Typedef
* Output			:	None
* Return			:	None
* Attention			:	None
*******************************************************************************/
void ina219_updateConfigurationRegister(uint16_t reg_bits, INA219Mask_Typedef mask){
	uint16_t reg_value;

	/* Read the current configuration register value */
	ina219_readRegister(INA219_REG_CONFIG, &reg_value);

	/* First clear masking bits,bit-13 */
	reg_value &= ~(mask);	// Clear bit-13
	/* Then restore the current bits */
	reg_value = reg_value | reg_bits;

	/* Write the 16-bit current value to configuration register */
	ina219_writeRegister(INA219_REG_CONFIG, reg_value);
}
